ContextualElectronics/CElectronics/Temperature/Packages/.cache/Keil.TMPM3_DFP.1.3.0.pdsc
          <book name="Documents/TMPM333FDFG_datasheet_en_20101006.pdf" title="M333FDFG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="12"      m="10"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="78"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM333FWFG'  ***************************** -->
        <device Dname="TMPM333FWFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM333.h"/>
          <debug svd="SVD/M333.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM33x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM333FWFG_datasheet_en_20101006.pdf" title="M333FWFG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="12"      m="10"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="78"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM333FYFG'  ***************************** -->
        <device Dname="TMPM333FYFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM333.h"/>
          <debug svd="SVD/M333.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM33x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/TMPM333FYFG_datasheet_en_20101006.pdf" title="M333FYFG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="12"      m="10"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="78"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'M340'  **************************** -->
      <subFamily DsubFamily="M340">
        <feature type="Temp"          n="-40"     m="85"/>

        <!-- *************************  Device 'TMPM341FDXBG'  ***************************** -->
        <device Dname="TMPM341FDXBG">
          <processor Dclock="54000000"/>
          <compile header="Device/Include/TMPM341.h"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM341_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/TMPM341FDXBG_datasheet_en_20130611.pdf" title="M341FDXBG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="UART"          n="5"                           name="UART/SIO"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="Timer"         n="2"       m="16"              name="Hi-resolution 16Bit Timer"/>
          <feature type="ExtInt"        n="12"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="86"/>
          <feature type="VCC"           n="1.65"    m="3.60"/>
          <feature type="BGA"           n="113"/>
        </device>

        <!-- *************************  Device 'TMPM341FYXBG'  ***************************** -->
        <device Dname="TMPM341FYXBG">
          <processor Dclock="54000000"/>
          <compile header="Device/Include/TMPM341.h"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM341_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/TMPM341FYXBG_datasheet_en_20130611.pdf" title="M341FYXBG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="UART"          n="5"                           name="UART/SIO"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="Timer"         n="2"       m="16"              name="Hi-resolution 16Bit Timer"/>
          <feature type="ExtInt"        n="12"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="86"/>
          <feature type="VCC"           n="1.65"    m="3.60"/>
          <feature type="BGA"           n="113"/>
        </device>

        <!-- *************************  Device 'TMPM342FYXBG'  ***************************** -->
        <device Dname="TMPM342FYXBG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM342.h"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00009000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM342_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

