ContextualElectronics/CElectronics/Temperature/Packages/.cache/Keil.TMPM3_DFP.1.3.0.pdsc
        <!-- *************************  Device 'TMPM369FYXBG'  ***************************** -->
        <device Dname="TMPM369FYXBG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM369.h"/>
          <debug svd="SVD/M369.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM369FYXBG Reference Manual"/-->

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="CAN"           n="1"/>
          <feature type="USBD"          n="1"/>
          <feature type="USBH"          n="1"                           name="USB Host (Full Speed)"/>
          <feature type="ETH"           n="1"       m="100000000"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="102"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="177"/>
        </device>

        <!-- *************************  Device 'TMPM36BF10FG'  ***************************** -->
        <device Dname="TMPM36BF10FG">
          <processor Dclock="64000000"/>
          <compile header="Device/Include/TMPM36B.h"/>
          <debug svd="SVD/M36B.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x20000000" size="0x00040800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_1024.FLM" start="0x00000000" size="0x00100000"             default="1"/>

          <book name="Documents/TMPM36BF10FG_datasheet_en_20130809.pdf" title="M36BF10FG Reference Manual"/>

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM36BFYFG'  ***************************** -->
        <device Dname="TMPM36BFYFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM36B.h"/>
          <debug svd="SVD/M36B.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM365_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/TMPM36BFYFG_datasheet_en_20131219.pdf" title="M36BFYFG Reference Manual"/>

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>
      </subFamily>

