ContextualElectronics/CElectronics/Temperature/Packages/.cache/Keil.TMPM3_DFP.1.3.0.pdsc
      <!-- ************************  Subfamily 'M370'  **************************** -->
      <subFamily DsubFamily="M370">
        <feature type="Other"         n="1"                           name="Vector Engine(VE)"/>
        <feature type="VCC"           n="4.50"    m="5.50"/>

        <!-- *************************  Device 'TMPM370FYDFG'  ***************************** -->
        <device Dname="TMPM370FYDFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM370.h"/>
          <debug svd="SVD/M370.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM370_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/TMPM370FYDFG_datasheet_en_20130415.pdf" title="M370FYDFG Reference Manual"/>

          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="ADC"           n="22"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="76"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM370FYFG'  ***************************** -->
        <device Dname="TMPM370FYFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM370.h"/>
          <debug svd="SVD/M370.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM370_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/TMPM370FYFG_datasheet_en_20130415.pdf" title="M370FYFG Reference Manual"/>

          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="ADC"           n="22"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="76"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM372FWFG'  ***************************** -->
        <device Dname="TMPM372FWFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM372.h"/>
          <debug svd="SVD/M372.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM37x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM372FWFG Reference Manual"/-->

          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="ADC"           n="11"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="IOs"           n="53"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'TMPM372FWUG'  ***************************** -->
        <device Dname="TMPM372FWUG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM372.h"/>
          <debug svd="SVD/M372.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM37x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM372FWUG_datasheet_en_20130415.pdf" title="M372FWUG Reference Manual"/>

          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="ADC"           n="11"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="IOs"           n="53"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'TMPM373FWDUG'  ***************************** -->
        <device Dname="TMPM373FWDUG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM373.h"/>
          <debug svd="SVD/M373.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM37x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

