ContextualElectronics/CElectronics/Temperature/Packages/.cache/Keil.TMPM3_DFP.1.3.0.pdsc
    <!-- Startup TMPM363 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM363 CMSIS">
      <description>System Startup for Toshiba TMPM363 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM363.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM363.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM364 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM364 CMSIS">
      <description>System Startup for Toshiba TMPM364 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM364.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM364.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM365 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM365 CMSIS">
      <description>System Startup for Toshiba TMPM365 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM365.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM365.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM366 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM366 CMSIS">
      <description>System Startup for Toshiba TMPM366 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM366.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM366.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM367 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM367 CMSIS">
      <description>System Startup for Toshiba TMPM367 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM367.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM367.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM368 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM368 CMSIS">
      <description>System Startup for Toshiba TMPM368 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM368.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM368.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM369 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM369 CMSIS">
      <description>System Startup for Toshiba TMPM369 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM369.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM369.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM36B -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM36B CMSIS">
      <description>System Startup for Toshiba TMPM36B Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM36B.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM36B.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM370 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM370 CMSIS">
      <description>System Startup for Toshiba TMPM370 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM370.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM370.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM372 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM372 CMSIS">
      <description>System Startup for Toshiba TMPM372 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM372.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM372.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM373 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM373 CMSIS">
      <description>System Startup for Toshiba TMPM373 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM373.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM373.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM374 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM374 CMSIS">
      <description>System Startup for Toshiba TMPM374 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM374.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM374.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM375 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM375 CMSIS">
      <description>System Startup for Toshiba TMPM375 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM375.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM375.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM376 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM376 CMSIS">
      <description>System Startup for Toshiba TMPM376 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM376.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM376.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

